Revit 2027 API
XYZ.BasisX Property
The basis of the X axis.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static XYZ BasisX { get; }
Public Shared ReadOnly Property BasisX As XYZ
	Get
public:
static property XYZ^ BasisX {
	XYZ^ get ();
}
static member BasisX : XYZ with get
Property Value
XYZ
Remarks
The basis of the X axis is the vector (1,0,0), the unit vector on the X axis.
See Also
Reference
XYZ Class
Autodesk.Revit.DB Namespace